# 📚 Полезные ссылки на статьи и разборы задач:
# 📘 Полная версия шпаргалки доступна в нашем тг канале: https://t.me/informatika_kege_itpy/362?comment=6532
# 📘 Разборы 7 номеров по информатике: https://t.me/informatika_kege_itpy/360?comment=1470

# region Место для вашего конспекта ⬇️
'''
Запустите бота: https://t.me/ilandroxxy_bot и нажмите кнопку: "📚 Получить конспект"
'''
# Таблица измерения единиц информации (101010101001011 бит)
# 1 бит - минимальная единица измерения информации
# 1 байт - 8 бит - 2**3 бит
# 1 Кбайт - 1024 байт - 2**10 байт - 2**13 бит
# 1 Мбайт - 1024 Кбайт - 2**20 байт - 2**23 бит
# 1 Гбайт - 1024 Мбайт - 2**30 байт - 2**33 бит


# V = pixels * i - вес изображения (в бит)
# i - бит выделено на один пиксель (глубина цвета)
# colors = 2 ** i


# https://education.yandex.ru/ege/inf/task/37dd91ce-1a3d-4d33-9370-445d9c44bb85
'''
pixels = 300 * 400
i = 5
V = pixels * i
print(V)  # 600000
print(V / 8)  # 75000
'''

# https://education.yandex.ru/ege/inf/task/c750feb6-6609-485a-8bd0-c62b806727d3
# Сколько секунд потребуется обычному модему, передающему сообщения
# со скоростью 65536 бит/с, чтобы передать цветное растровое изображение
# размером 1024 на 768 пикселей, при условии, что в палитре 24 цвета?
'''
pixels = 1024 * 768
colors = 24
i = 5
V = pixels * i  # бит

U = 65536  # бит/с
print(V / U)  # 60
'''


# https://education.yandex.ru/ege/inf/task/957625ec-a644-4180-bcee-896315e53052
'''
pixels = 2560 * 1440
i = 30
V = pixels * i


pixels2 = 1920 * 1080
i2 = 28
V2 = pixels2 * i2

print((V - V2) * 130 / 2**13)
'''



# https://education.yandex.ru/ege/inf/task/935e9e59-a795-4e5b-bad5-013dfefb5a5a
'''
pixels = 1280 * 1024
V = 800 * 2**13

i = V / pixels
print(i)  # 5.0 - цвета + четность - 4 + 1

print(2 ** 4)  # 16
'''

# https://education.yandex.ru/ege/inf/task/4e5be1a0-54c9-454c-819a-0f8b27b8c0e6
'''
pixels = 320 * 512
V = 50 * 2**13
V = (V / 100) * 155
i = V / pixels
print(i)  # 3.875 -> 4
'''


# https://education.yandex.ru/ege/inf/task/5b2df675-96d3-460d-b1ed-e3dfb6ed7c63
'''
pixels = 2560 * 1440
pack = 2**33
V = pack / 200
i = V / pixels
print(i)  # 11.6508
print(2 ** 11)
'''

# V = a * b * c * t  (бит) - вес звукового файла
# a - кол-во каналов: моно/стерео/квадра - 1/2/4
# b - частота дискретизации: Гц
# c - глубиной кодирования: бит
# t - время звукозаписи: сек


# https://education.yandex.ru/ege/inf/task/8172e3b1-0da6-40a8-96c1-c0a5c2131296
'''
a = 2
b = 56000
c = 16
t = 2*60
V = a * b * c * t  # бит
print(V)

U = 32000  # бит/с
print(V / U)  # 6720


a = 2
b = 56000
c = 16
t = 2*60
V2 = a * b/2 * c * t  # бит
print(V2 / U)
'''


# https://education.yandex.ru/ege/inf/task/5b08e032-88b8-4cff-8b63-329f996e0472
'''
# V = a * b * c * t 

t = 90
b = 48000
a = 2

U = 1600  # бит/с
T = 86400  # с
V = U * T

c = V / (a * b * t)
print(c)  # 16

# максимальное количество уровней громкости
print(2**16)
'''


# https://education.yandex.ru/ege/inf/task/21c8d3fd-6a3a-4352-aaa3-fcfd629d1c75
'''
a = 2
b = 192000
c = 24
t = 10 * 60
V = a * b * c * t

U = 12800  # бит/с
T = 20  # с
V_half = U * T

print(V / V_half)
'''


# https://education.yandex.ru/ege/inf/task/8866b77f-df4a-4339-b500-dce62b0b720e
'''
pix = 1024*768
i = 23
v = pix*i


pix1 = 800*600
i1 = 22
v1 = pix1 * i1
print((v-v1)*100/2**13) #91893
'''

# endregion Место для вашего конспекта ⬆️

# Домашка 7 номер: https://stepik.org/lesson/1038609/step/1?unit=1062783

# Практика 7 номер: https://stepik.org/lesson/1209349/step/1?unit=1222584
